#include <stdio.h>
#include <stdlib.h>
/*
 * Профессор нашёл поляну, на которой лежали три кучи камней,
 * и решил проверить, умеют ли аборигены считать. Профессор отвёл одного из
 * аборигенов на поляну и дал ему задание: показать на две кучи с минимальной
 * разницей количества камней в них и ответить, чему равна эта разница.
 * И абориген справился! Поскольку он не мог выразить разницу словами, он сходил
 * на берег моря и принёс на поляну кучу с таким количеством камней.
 * Профессор решил повторять свой эксперимент с другими аборигенами, пока
 * какой-то из них не укажет на две кучи с одинаковым количеством камней.
 * Все камни, которые приносят аборигены, остаются лежать на поляне. Так,
 * второму аборигену досталось уже на одну кучу больше — на ту самую, которую
 * принёс первый испытуемый.
 *
 * Исходные данные:
 * В единственной строке через пробел записаны попарно различные целые числа
 * x1, x2 и x3 (1 ≤ x1, x2, x3 ≤ 1018) — количество камней в кучах,
 * лежавших на поляне в тот момент, когда профессор позвал первого аборигена.
 *
 * Результат:
 * Выведите, скольким аборигенам сможет задать свой глупый вопрос профессор.
 */

int main(void) {
  int counter = 0;
  printf("%d\n", counter);
  return 0;
}
